cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'coreutils'
brew 'curl'
brew 'htop'
brew 'git'
brew 'gradle'
brew 'gzip'
brew 'heroku'
brew 'mongodb', restart_service: true
brew 'nginx'
brew 'nvm'
brew 'mas'
brew 'openssl'
brew 'python'
brew 'python3'
brew 'ruby-build'
brew 'rbenv'
brew 'redis', restart_service: true
brew 'swiftlint'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zsh'

cask 'appcleaner'
cask 'charles'
cask 'cord'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'kdiff3'
cask 'paw'
cask 'sourcetree'
cask 'github-desktop'
cask 'sketch'

cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-inconsolata'

mas 'Twitter', id: 409789998
mas 'Tweetbot for Twitter', id: 557168941
mas 'iA Writer', id: 775737590
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Reeder', id: 880001334