cask_args appdir: /Applications

tap homebrew/bundle

brew 'coreutils'
brew 'curl'
brew 'git'
brew 'gradle'
brew 'heroku'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'python'
brew 'python3'
brew 'ruby-build'
brew 'rbenv'
brew 'swiftlint'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zsh'

cask 'appcleaner'
cask 'charles'
cask 'iterm2'
cask 'slack'
cask 'vlc'